<?php
/**
 * Created by PhpStorm.
 * User: 李作霖 QQ: 604625124
 * Date: 2017/7/9
 * Time: 15:23
 */

return [
    /*
    |--------------------------------------------------------------------------
    | 文件缓存
    |--------------------------------------------------------------------------
    |
    | 文件缓存配置
    |
    | path 文件缓存路径
    |
    */
    'fileStore' => array(
        'path' => APP_STORAGE_PATH . 'cache' . DS,
    ),

    /*
    |--------------------------------------------------------------------------
    | memcached缓存
    |--------------------------------------------------------------------------
    |
    | memcache缓存配置
    |
    | host memcache主机
    | port memcache端口
    |
    */
    'memcached' => array(
        array(
            'host' => 'localhost',
            'port' => '11211',
        ),
    ),

    /*
    |--------------------------------------------------------------------------
    | memcache缓存
    |--------------------------------------------------------------------------
    |
    | memcache缓存配置
    |
    | host   memcache主机，或Unix域套接字
    | port   memcache端口，使用Unix域套接字时port设置为0
    | weight 用来控制此服务器被选中的权重
    |
    */
    'memcache' => array(
        array(
            'host' => 'localhost',
            'port' => '11211',
            'weight' => 1,
        )
    ),

    /*
    |--------------------------------------------------------------------------
    | redis缓存
    |--------------------------------------------------------------------------
    |
    | memcache缓存配置
    |
    | host memcache主机
    | port memcache端口
    |
    */
    'redis' => array(
        'host' => 'localhost',
        'port' => '6379',
        'timeout' => '0.0'
    ),
];